pokeMACWeb/app/views/welcome/positions.html.erb

SELECT  "answers".* FROM "answers" WHERE "answers"."user_id" = 2 AND "answers"."question_id" = 25 LIMIT ?  [["LIMIT", 1]]
---
				<% (5..27).reverse_each do |number| %>
					<%if Answer.find_by(user: user1.id, question: number)%>

SELECT COUNT(*) FROM "answers" WHERE "answers"."user_id" = 2
---
					<% end %>
					<td scope="col"><%=Answer.where(user: user1.id).count-1%></td>