pokeMACWeb/app/controllers/pokedex_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def pokelist
    	@pokemons = Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."name" = ? LIMIT ?  [["name", "manuel"], ["LIMIT", 1]]
---
    def view_pokemon
        redirect_to view_pokemon_show_path(Pokemon.find_by(name:params[:name])) if params[:name]

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def view_pokemon_show
        @pokemon = Pokemon.find_by(id:request.path_parameters[:id]) if request.path_parameters[:id]