pokeMACWeb/app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE (INICIO) LIMIT ?  [["LIMIT", 1]]
---
    def index

        @questions = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."title" = ? LIMIT ?  [["title", "exp"], ["LIMIT", 1]]
INSERT INTO "answers" ("question_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 26], ["user_id", 19], ["created_at", "2018-03-20 01:53:14.236276"], ["updated_at", "2018-03-20 01:53:14.236276"]]
---
    def preg
        puts params[:id]
        numero = params[:id]
        if params[:title].eql? "huir"
            redirect_to preg_path(Question.find(numero.to_i - 1))
        else
            puts "Epalee222"
            if Question.find_by(title:params[:title])
                if params[:title].eql? "inicio"
                    redirect_to preg_path(Question.find(27))
                else
                    puts "EPALEE33"
                    puts params[:title]
                    puts numero
                    @answer = Answer.new
                    @answer.question = Question.find(numero.to_i)
                    @answer.user = current_user
                    @answer.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @map="kanto.jpg"
        @question = Question.find(params[:id])