pokeMACWeb/app/controllers/welcome_controller.rb

  def positions
  	@users = User.all.order("created_at DESC")
---
SELECT "users".* FROM "users" ORDER BY created_at DESC